Revit 2026 API

# DocumentSeparateElements Method

---

Separate a set of combinable elements out of combinations they currently belong to.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SeparateElements(
	CombinableElementArray members
)
```
```vb
Public Sub SeparateElements (
	members As CombinableElementArray
)
```
```cpp
public:
void SeparateElements(
	CombinableElementArray^ members
)
```
```fsharp
member SeparateElements :
        members : CombinableElementArray -> unit
```

#### Parameters

members CombinableElementArray
    A list of combinable elements to be separated.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument is . |
| ArgumentException | Thrown when members is empty. Thrown when members contains  elements. |
| InvalidOperationException | Thrown when separation failed. |

If geometry combination elements are passed as input, they will be completely separated and deleted. If generic forms that happen to belong to combination elements are passed, these forms will be removed from their geometry combination. The handles of geometry combinations completely removed by this operation are no longer valid.

#### Reference

Document Class

Autodesk.Revit.DB Namespace